# https://docs.brew.sh/Brew-Bundle-and-Brewfile#brew-bundle-upgrade-and-homebrew_bundle_no_upgrade1
# brew bundle --no-upgrade --verbose

brew "fish" # Friendly interactive shell
brew "tmux" # Terminal multiplexer
brew "starship" # Cross-shell prompt for astronauts

brew "mise" # Polyglot runtime manager (asdf rust clone)
brew "yarn" # JavaScript package manager

brew "eza" # Modern, maintained replacement for ls
brew "bat" # Clone of cat with syntax highlighting and Git integration
brew "fzf" # Command-line fuzzy finder written in Go
brew "fd" # Simple, fast and user-friendly alternative to find
brew "jq" # Lightweight and flexible command-line JSON processor

brew "jless" # Command-line JSON viewer
brew "pv" # Monitor data's progress through a pipe

brew "htop" # Improved top (interactive process viewer)
brew "btop" # A monitor of resources

brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "dua-cli" # View disk space usage and delete unwanted data, fast
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)
brew "git-delta" # A syntax-highlighting pager for git, diff, grep, and blame output

brew "awscli" # Official Amazon AWS command-line interface
brew "aws-vault" # Securely store and access AWS credentials

brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "ffmpeg" # Play, record, convert, and stream audio and video

brew "mysql@8.4" # Open source relational database management system
brew "tomcat@8" # Implementation of Java Servlet and JavaServer Pages

brew "nvim" # Ambitious Vim-fork focused on extensibility and agility

# https://derflounder.wordpress.com/2025/04/06/rsync-replaced-with-openrsync-on-macos-sequoia/
brew "rsync" # since macOS Sequoia is now using openrsync

# Fonts

# Maple Mono
cask "font-maple-mono"
cask "font-maple-mono-nf"
