brew "rbenv"
brew "yarn"

# prefira instalar o node usando o nvm
# https://github.com/nvm-sh/nvm
# brew "node"

brew "mysql"

brew "imagemagick"
brew "ffmpeg"

brew "tomcat@8"
brew "ant"

brew "eza"
brew "bat"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "dua"
brew "htop"
brew "jq"
brew "diff-so-fancy"
brew "httpie"

cask "ngrok"
