brew "openssl"
brew "readline"

brew "rbenv"
brew "yarn"
brew "node"

brew "mysql@5.7"

brew "imagemagick"
brew "ffmpeg"

brew "tomcat@8"
brew "ant"

brew "exa"
brew "bat"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "htop"
brew "jq"
brew "todo-txt"
brew "diff-so-fancy"

cask "ngrok"
